Revit 2027 API
FamilyParameter.GUID Property
The globally unique identifier
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GUID { get; }
Public ReadOnly Property GUID As Guid
	Get
public:
property Guid GUID {
	Guid get ();
}
member GUID : Guid with get
Property Value
Guid
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the parameter is not a shared parameter.
Example
foreach (FamilyParameter familyParam in familyDoc.FamilyManager.Parameters)
{
    string familyParamName = familyParam.Definition.Name;
    try
    {
        Guid guid = familyParam.GUID;
        TaskDialog.Show("Revit",familyParamName + " is shared. Guid is " + guid);
    }
    catch (System.Exception)
    {
        TaskDialog.Show("Revit",familyParamName + " is NOT shared");
    }
}
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace